In [16]:
import warnings
warnings.filterwarnings('ignore')

In [17]:
import pandas as pd
train_df = pd.read_csv('./datasets/titanic_train.csv')
test_df = pd.read_csv('./datasets/titanic_test.csv')
test_y_df = pd.read_csv('./datasets/titanic_gender_submission.csv')

In [18]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [20]:
train = train_df[['Pclass', 'Sex', 'Age', 'Survived']]
test = test_df[['Pclass', 'Sex', 'Age']]
test_y = test_y_df['Survived']

In [21]:
train.isnull().sum()

Pclass        0
Sex           0
Age         177
Survived      0
dtype: int64

In [22]:
train = train.dropna(axis=0)

In [23]:
train.isnull().sum()

Pclass      0
Sex         0
Age         0
Survived    0
dtype: int64

In [24]:
train.describe()

           Pclass         Age    Survived
count  714.000000  714.000000  714.000000
mean     2.236695   29.699118    0.406162
std      0.838250   14.526497    0.491460
min      1.000000    0.420000    0.000000
25%      1.000000   20.125000    0.000000
50%      2.000000   28.000000    0.000000
75%      3.000000   38.000000    1.000000
max      3.000000   80.000000    1.000000

In [25]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Index: 714 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    714 non-null    int64
 1   Sex       714 non-null    object
 2   Age       714 non-null    float64
 3   Survived  714 non-null    int64
dtypes: float64(1), int64(2), object(1)
memory usage: 27.9+ KB

In [26]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
data = encoder.fit_transform(train['Sex'])

In [27]:
train['Sex'] = data

In [28]:
train.head()

   Pclass  Sex   Age  Survived
0       3    1  22.0         0
1       1    0  38.0         1
2       3    0  26.0         1
3       1    0  35.0         1
4       3    1  35.0         0

In [39]:
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
data = scaler.fit_transform(train[['Age']])
train['Age'] = data

In [40]:
train.head()

   Pclass  Sex       Age  Survived
0       3    1  0.271174         0
1       1    0  0.472229         1
2       3    0  0.321438         1
3       1    0  0.434531         1
4       3    1  0.434531         0

In [43]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
dt = DecisionTreeClassifier(random_state = 42)
rf = RandomForestClassifier(random_state = 42)
lr = logistic = LogisticRegression()

In [44]:
from sklearn.model_selection import cross_val_score

In [57]:
X = train.drop('Survived', axis = 1)
y = train['Survived']

result_dict = {
    'dt':[],
    'rf' : [],
    'lr' : []
}

for index , algorithm in enumerate([dt , rf ,lr]):
    print(algorithm)
    result = cross_val_score(algorithm , X , y )
    if index == 0 :
        result_dict['dt'] = result
    elif index == 1 :
        result_dict['rf'] = result
    else:
        result_dict['lr'] = result

In [68]:
import numpy as np
print(np.mean(result_dict['dt']))
print(np.mean(result_dict['rf']))
print(np.mean(result_dict['lr']))

nan
nan
nan

In [69]:
test

     Pclass     Sex   Age
0         3    male  34.5
1         3  female  47.0
2         2    male  62.0
3         3    male  27.0
4         3  female  22.0
..      ...     ...   ...
413       3    male   NaN
414       1  female  39.0
415       3    male  38.5
416       3    male   NaN
417       3    male   NaN

[418 rows x 3 columns]

In [70]:
test['Survived'] = test_y_df['Survived']
test

     Pclass     Sex   Age  Survived
0         3    male  34.5         0
1         3  female  47.0         1
2         2    male  62.0         0
3         3    male  27.0         0
4         3  female  22.0         1
..      ...     ...   ...       ...
413       3    male   NaN         0
414       1  female  39.0         1
415       3    male  38.5         0
416       3    male   NaN         0
417       3    male   NaN         0

[418 rows x 4 columns]

In [73]:
test.dropna(axis=0, inplace=True)

In [74]:
test.isna().sum()

Pclass      0
Sex         0
Age         0
Survived    0
dtype: int64

In [76]:
encoder = LabelEncoder()
data = encoder.fit_transform(test['Sex'])  
test['Sex'] = data

In [77]:
test.head()

   Pclass  Sex   Age  Survived
0       3    1  34.5         0
1       3    0  47.0         1
2       2    1  62.0         0
3       3    1  27.0         0
4       3    0  22.0         1

In [78]:
scaler = MinMaxScaler()
data = scaler.fit_transform(test[['Age']])
test['Age'] = data

In [81]:
X_test = test.drop('Survived', axis=1)
rf.fit(X, y)
pred_rf = rf.predict(X_test)

In [82]:
from sklearn.metrics import accuracy_score
accuracy_score(test['Survived'], pred_rf)

0.8403614457831325

In [83]:
dt.fit(X, y)
pred_dt = dt.predict(X_test)
accuracy_score(test['Survived'], pred_dt)

0.8192771084337349

In [84]:
lr.fit(X, y)
pred_lr = lr.predict(X_test)
accuracy_score(test['Survived'], pred_lr)

0.927710843373494